pillo79/ArduinoCore-zephyr/variants/arduino_nano_33_ble_nrf52840_sense/llext-edk/include/modules/hal/nordic/nrfx/hal/nrf_spu.h
/*
 * Copyright (c) 2018 - 2025, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * 3. Neither the name of the copyright holder nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef NRF_SPU_H__
#define NRF_SPU_H__

#include <nrfx.h>

#ifdef __cplusplus
extern "C" {
#endif

/**
 * @defgroup nrf_spu_hal SPU HAL
 * @{
 * @ingroup nrf_spu
 * @brief   Hardware access layer for managing the System Protection Unit (SPU) peripheral.
 */

#if defined(SPU_PERIPHACCERR_ADDRESS_ADDRESS_Msk) || defined(__NRFX_DOXYGEN__)
/** @brief Presence of peripheral access feature. */
#define NRF_SPU_HAS_PERIPHERAL_ACCESS 1
#else
#define NRF_SPU_HAS_PERIPHERAL_ACCESS 0
#endif

#if defined(SPU_PERIPHACCERR_INFO_OWNERID_Msk) || defined(__NRFX_DOXYGEN__)
/**
 * @brief Symbol indicating whether register containing information about the transaction
 *        that caused peripheral access error is present.
 */
#define NRF_SPU_HAS_PERIPHERAL_ACCESS_ERROR_INFO 1
#else
#define NRF_SPU_HAS_PERIPHERAL_ACCESS_ERROR_INFO 0
#endif

#if defined(SPU_PERIPH_PERM_OWNERPROG_Msk) || defined(__NRFX_DOXYGEN__)
/** @brief Presence of ownership feature. */
#define NRF_SPU_HAS_OWNERSHIP 1
#else
#define NRF_SPU_HAS_OWNERSHIP 0
#endif

#if defined(SPU_FLASHREGION_PERM_EXECUTE_Msk) || defined(__NRFX_DOXYGEN__)
/** @brief Presence of memory feature. */
#define NRF_SPU_HAS_MEMORY 1
#else
#define NRF_SPU_HAS_MEMORY 0
#endif

#if defined(SPU_PERIPH_PERM_BLOCK_Msk) || defined(__NRFX_DOXYGEN__)
/** @brief Symbol indicating whether block feature is present. */
#define NRF_SPU_HAS_BLOCK 1
#else
#define NRF_SPU_HAS_BLOCK 0
#endif

#if defined(SPU_FEATURE_BELLS_DOMAIN_MaxCount) || defined(SPU_FEATURE_BELLS_PROCESSOR_MaxCount) \
    || defined(__NRFX_DOXYGEN__)
/** @brief Symbol indicating whether SPU has registers related to BELLS. */
#define NRF_SPU_HAS_BELLS 1
#else
#define NRF_SPU_HAS_BELLS 0
#endif

#if defined(SPU_FEATURE_BELLS_DOMAIN_MaxCount) || defined(__NRFX_DOXYGEN__)
/** @brief Symbol indicating whether SPU uses DOMAIN register name. */
#define NRF_SPU_HAS_DOMAIN 1
#else
#define NRF_SPU_HAS_DOMAIN 0
#endif

#if defined(SPU_FEATURE_IPCT_CH_MaxCount) || defined(__NRFX_DOXYGEN__)
/** @brief Symbol indicating whether SPU has registers related to IPCT. */
#define NRF_SPU_HAS_IPCT 1
#else
#define NRF_SPU_HAS_IPCT 0
#endif

#if defined(SPU_FEATURE_TDD_MaxCount) || defined(__NRFX_DOXYGEN__)
/** @brief Symbol indicating whether SPU has registers related to TDD. */
#define NRF_SPU_HAS_TDD 1
#else
#define NRF_SPU_HAS_TDD 0
#endif

#if defined(SPU_FEATURE_MRAMC_MaxCount) || defined(__NRFX_DOXYGEN__)
/** @brief Symbol indicating whether SPU has registers related to MRAMC. */
#define NRF_SPU_HAS_MRAMC 1
#else
#define NRF_SPU_HAS_MRAMC 0
#endif

#if NRF_SPU_HAS_PERIPHERAL_ACCESS

/** @brief Number of peripherals. */
#define NRF_SPU_PERIPH_COUNT                     SPU_PERIPH_MaxCount

#if NRF_SPU_HAS_IPCT
/** @brief Number of IPCT channels. */
#define NRF_SPU_FEATURE_IPCT_CHANNEL_COUNT       SPU_FEATURE_IPCT_CH_MaxCount

/** @brief Number of IPCT interrupts. */
#define NRF_SPU_FEATURE_IPCT_INTERRUPT_COUNT     SPU_FEATURE_IPCT_INTERRUPT_MaxCount
#endif

/** @brief Number of DPPI channels. */
#define NRF_SPU_FEATURE_DPPI_CHANNEL_COUNT       SPU_FEATURE_DPPIC_CH_MaxCount

/** @brief Number of DPPI channel groups. */
#define NRF_SPU_FEATURE_DPPI_CHANNEL_GROUP_COUNT SPU_FEATURE_DPPIC_CHG_MaxCount

/** @brief Number of GPIOTEs. */
#define NRF_SPU_FEATURE_GPIOTE_COUNT             SPU_FEATURE_GPIOTE_MaxCount

/** @brief Number of GPIOTE channels. */
#define NRF_SPU_FEATURE_GPIOTE_CHANNEL_COUNT     SPU_FEATURE_GPIOTE_CH_MaxCount

/** @brief Number of GPIOTE interrupts. */
#define NRF_SPU_FEATURE_GPIOTE_INTERRUPT_COUNT   SPU_FEATURE_GPIOTE_INTERRUPT_MaxCount

/** @brief Number of GPIOs. */
#define NRF_SPU_FEATURE_GPIO_COUNT               SPU_FEATURE_GPIO_MaxCount

/** @brief Number of GPIO pins. */
#define NRF_SPU_FEATURE_GPIO_PIN_COUNT           SPU_FEATURE_GPIO_PIN_MaxCount

/** @brief Number of GRTC compare channels. */
#define NRF_SPU_FEATURE_GRTC_CC_COUNT            SPU_FEATURE_GRTC_CC_MaxCount

/** @brief Number of GRTC interrupts.. */
#define NRF_SPU_FEATURE_GRTC_INTERRUPT_COUNT     SPU_FEATURE_GRTC_INTERRUPT_MaxCount

/** @brief Number of BELL domains. */
#if NRF_SPU_HAS_DOMAIN
#define NRF_SPU_FEATURE_BELL_DOMAIN_COUNT        SPU_FEATURE_BELLS_DOMAIN_MaxCount
#else
#define NRF_SPU_FEATURE_BELLS_PROCESSOR_COUNT    SPU_FEATURE_BELLS_PROCESSOR_MaxCount
#endif

/** @brief Number of BELL Domain/Processor features. */
#if NRF_SPU_HAS_DOMAIN
#define NRF_SPU_FEATURE_BELL_BELL_COUNT          SPU_FEATURE_BELLS_DOMAIN_BELL_MaxCount
#else
#define NRF_SPU_FEATURE_BELLS_TASKS_COUNT        SPU_FEATURE_BELLS_PROCESSOR_TASKS_MaxCount
#define NRF_SPU_FEATURE_BELLS_EVENTS_COUNT       SPU_FEATURE_BELLS_PROCESSOR_EVENTS_MaxCount
#define NRF_SPU_FEATURE_BELLS_INTERRUPT_COUNT    SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_MaxCount
#endif

#if NRF_SPU_HAS_TDD
/** @brief Number of TDDs. */
#define NRF_SPU_FEATURE_TDD_COUNT                SPU_FEATURE_TDD_MaxCount
#endif

#if NRF_SPU_HAS_MRAMC
/** @brief Number of MRAMCs. */
#define NRF_SPU_FEATURE_MRAMC_COUNT              SPU_FEATURE_MRAMC_MaxCount
#endif

#endif // NRF_SPU_HAS_PERIPHERAL_ACCESS

/** @brief SPU events. */
typedef enum
{
#if NRF_SPU_HAS_MEMORY
    NRF_SPU_EVENT_RAMACCERR    = offsetof(NRF_SPU_Type, EVENTS_RAMACCERR),    ///< A security violation has been detected for the RAM memory space.
    NRF_SPU_EVENT_FLASHACCERR  = offsetof(NRF_SPU_Type, EVENTS_FLASHACCERR),  ///< A security violation has been detected for the Flash memory space.
#endif
    NRF_SPU_EVENT_PERIPHACCERR = offsetof(NRF_SPU_Type, EVENTS_PERIPHACCERR), ///< A security violation has been detected on one or several peripherals.
} nrf_spu_event_t;

/** @brief SPU interrupts. */
typedef enum
{
#if NRF_SPU_HAS_MEMORY
    NRF_SPU_INT_RAMACCERR_MASK     = SPU_INTENSET_RAMACCERR_Msk,   ///< Interrupt on RAMACCERR event.
    NRF_SPU_INT_FLASHACCERR_MASK   = SPU_INTENSET_FLASHACCERR_Msk, ///< Interrupt on FLASHACCERR event.
#endif
    NRF_SPU_INT_PERIPHACCERR_MASK  = SPU_INTENSET_PERIPHACCERR_Msk ///< Interrupt on PERIPHACCERR event.
} nrf_spu_int_mask_t;

#if NRF_SPU_HAS_MEMORY
/** @brief SPU Non-Secure Callable (NSC) region size. */
typedef enum
{
    NRF_SPU_NSC_SIZE_DISABLED = 0, ///< Not defined as a non-secure callable region.
    NRF_SPU_NSC_SIZE_32B      = 1, ///< Non-Secure Callable region with a 32-byte size
    NRF_SPU_NSC_SIZE_64B      = 2, ///< Non-Secure Callable region with a 64-byte size
    NRF_SPU_NSC_SIZE_128B     = 3, ///< Non-Secure Callable region with a 128-byte size
    NRF_SPU_NSC_SIZE_256B     = 4, ///< Non-Secure Callable region with a 256-byte size
    NRF_SPU_NSC_SIZE_512B     = 5, ///< Non-Secure Callable region with a 512-byte size
    NRF_SPU_NSC_SIZE_1024B    = 6, ///< Non-Secure Callable region with a 1024-byte size
    NRF_SPU_NSC_SIZE_2048B    = 7, ///< Non-Secure Callable region with a 2048-byte size
    NRF_SPU_NSC_SIZE_4096B    = 8  ///< Non-Secure Callable region with a 4096-byte size
} nrf_spu_nsc_size_t;

/** @brief SPU memory region permissions. */
typedef enum
{
    NRF_SPU_MEM_PERM_EXECUTE = SPU_FLASHREGION_PERM_EXECUTE_Msk, ///< Allow code execution from particular memory region.
    NRF_SPU_MEM_PERM_WRITE   = SPU_FLASHREGION_PERM_WRITE_Msk,   ///< Allow write operation on particular memory region.
    NRF_SPU_MEM_PERM_READ    = SPU_FLASHREGION_PERM_READ_Msk     ///< Allow read operation from particular memory region.
} nrf_spu_mem_perm_t;
#endif

#if NRF_SPU_HAS_PERIPHERAL_ACCESS
/** @brief SPU read capabilities for TrustZone Cortex-M secure attribute. */
typedef enum
{
    NRF_SPU_SECUREMAPPING_NONSECURE      = SPU_PERIPH_PERM_SECUREMAPPING_NonSecure,
    NRF_SPU_SECUREMAPPING_SECURE         = SPU_PERIPH_PERM_SECUREMAPPING_Secure,
    NRF_SPU_SECUREMAPPING_USERSELECTABLE = SPU_PERIPH_PERM_SECUREMAPPING_UserSelectable,
    NRF_SPU_SECUREMAPPING_SPLIT          = SPU_PERIPH_PERM_SECUREMAPPING_Split,
} nrf_spu_securemapping_t;

/** @brief SPU DMA capabilities. */
typedef enum
{
    NRF_SPU_DMA_NODMA               = SPU_PERIPH_PERM_DMA_NoDMA,
    NRF_SPU_DMA_NOSEPARATEATTRIBUTE = SPU_PERIPH_PERM_DMA_NoSeparateAttribute,
    NRF_SPU_DMA_SEPARATEATTRIBUTE   = SPU_PERIPH_PERM_DMA_SeparateAttribute,
} nrf_spu_dma_t;

/** @brief SPU features. */
typedef enum
{
#if NRF_SPU_HAS_IPCT
    NRF_SPU_FEATURE_IPCT_CHANNEL,
    NRF_SPU_FEATURE_IPCT_INTERRUPT,
#endif
    NRF_SPU_FEATURE_DPPI_CHANNEL,
    NRF_SPU_FEATURE_DPPI_CHANNEL_GROUP,
    NRF_SPU_FEATURE_GPIOTE_CHANNEL,
    NRF_SPU_FEATURE_GPIOTE_INTERRUPT,
    NRF_SPU_FEATURE_GPIO_PIN,
    NRF_SPU_FEATURE_GRTC_CC,
    NRF_SPU_FEATURE_GRTC_SYSCOUNTER,
    NRF_SPU_FEATURE_GRTC_INTERRUPT,
#if NRF_SPU_HAS_BELLS
#if NRF_SPU_HAS_DOMAIN
    NRF_SPU_FEATURE_BELLS_BELL,
#else
    NRF_SPU_FEATURE_BELLS_TASKS,
    NRF_SPU_FEATURE_BELLS_EVENTS,
    NRF_SPU_FEATURE_BELLS_INTERRUPT,
#endif
#endif
#if NRF_SPU_HAS_TDD
    NRF_SPU_FEATURE_TDD,
#endif
#if NRF_SPU_HAS_MRAMC
    NRF_SPU_FEATURE_MRAMC_WAITSTATES,
    NRF_SPU_FEATURE_MRAMC_AUTODPOWERDOWN,
    NRF_SPU_FEATURE_MRAMC_READY
#endif
} nrf_spu_feature_t;

#endif

/**
 * @brief Function for clearing a specific SPU event.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] event Event to clear.
 */
NRF_STATIC_INLINE void nrf_spu_event_clear(NRF_SPU_Type *  p_reg,
                                           nrf_spu_event_t event);

/**
 * @brief Function for retrieving the state of the SPU event.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] event Event to be checked.
 *
 * @retval true  The event has been generated.
 * @retval false The event has not been generated.
 */
NRF_STATIC_INLINE bool nrf_spu_event_check(NRF_SPU_Type const * p_reg,
                                           nrf_spu_event_t      event);

/**
 * @brief Function for enabling specified interrupts.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] mask  Mask of interrupts to be enabled.
 *                  Use @ref nrf_spu_int_mask_t values for bit masking.
 */
NRF_STATIC_INLINE void nrf_spu_int_enable(NRF_SPU_Type * p_reg,
                                          uint32_t       mask);

/**
 * @brief Function for disabling specified interrupts.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] mask  Mask of interrupts to be disabled.
 *                  Use @ref nrf_spu_int_mask_t values for bit masking.
 */
NRF_STATIC_INLINE void nrf_spu_int_disable(NRF_SPU_Type * p_reg,
                                           uint32_t       mask);

/**
 * @brief Function for checking if the specified interrupts are enabled.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] mask  Mask of interrupts to be checked.
 *                  Use @ref nrf_spu_int_mask_t values for bit masking.
 *
 * @return Mask of enabled interrupts.
 */
NRF_STATIC_INLINE uint32_t nrf_spu_int_enable_check(NRF_SPU_Type const * p_reg, uint32_t mask);

#if NRF_SPU_HAS_MEMORY
/**
 * @brief Function for setting up publication configuration of a given SPU event.
 *
 * @param[in] p_reg   Pointer to the structure of registers of the peripheral.
 * @param[in] event   Event to configure.
 * @param[in] channel Channel to connect with published event.
 */
NRF_STATIC_INLINE void nrf_spu_publish_set(NRF_SPU_Type *  p_reg,
                                           nrf_spu_event_t event,
                                           uint32_t        channel);

/**
 * @brief Function for clearing publication configuration of a given SPU event.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] event Event to clear.
 */
NRF_STATIC_INLINE void nrf_spu_publish_clear(NRF_SPU_Type *  p_reg,
                                             nrf_spu_event_t event);

/**
 * @brief Function for retrieving the capabilities of the current device.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @retval true  ARM TrustZone support is available.
 * @retval false ARM TrustZone support is not available.
 */
NRF_STATIC_INLINE bool nrf_spu_tz_is_available(NRF_SPU_Type const * p_reg);

/**
 * @brief Function for configuring the DPPI channels to be available in particular domains.
 *
 * Channels are configured as bitmask. Set one in bitmask to make channels available only in secure
 * domain. Set zero to make it available in secure and non-secure domains.
 *
 * @param[in] p_reg         Pointer to the structure of registers of the peripheral.
 * @param[in] dppi_id       DPPI peripheral id.
 * @param[in] channels_mask Bitmask with channels configuration.
 * @param[in] lock_conf     Lock configuration until next SoC reset.
 */
NRF_STATIC_INLINE void nrf_spu_dppi_config_set(NRF_SPU_Type * p_reg,
                                               uint8_t        dppi_id,
                                               uint32_t       channels_mask,
                                               bool           lock_conf);

/**
 * @brief Function for configuring the GPIO pins to be available in particular domains.
 *
 * GPIO pins are configured as bitmask. Set one in bitmask to make particular pin available only
 * in secure domain. Set zero to make it available in secure and non-secure domains.
 *
 * @param[in] p_reg     Pointer to the structure of registers of the peripheral.
 * @param[in] gpio_port Port number.
 * @param[in] gpio_mask Bitmask with gpio configuration.
 * @param[in] lock_conf Lock configuration until next SoC reset.
 */
NRF_STATIC_INLINE void nrf_spu_gpio_config_set(NRF_SPU_Type * p_reg,
                                               uint8_t        gpio_port,
                                               uint32_t       gpio_mask,
                                               bool           lock_conf);

/**
 * @brief Function for configuring non-secure callable flash region.
 *
 * @param[in] p_reg          Pointer to the structure of registers of the peripheral.
 * @param[in] flash_nsc_id   Non-secure callable flash region ID.
 * @param[in] flash_nsc_size Non-secure callable flash region size.
 * @param[in] region_number  Flash region number.
 * @param[in] lock_conf      Lock configuration until next SoC reset.
 */
NRF_STATIC_INLINE void nrf_spu_flashnsc_set(NRF_SPU_Type *     p_reg,
                                            uint8_t            flash_nsc_id,
                                            nrf_spu_nsc_size_t flash_nsc_size,
                                            uint8_t            region_number,
                                            bool               lock_conf);

/**
 * @brief Function for configuring non-secure callable RAM region.
 *
 * @param[in] p_reg         Pointer to the structure of registers of the peripheral.
 * @param[in] ram_nsc_id    Non-secure callable RAM region ID.
 * @param[in] ram_nsc_size  Non-secure callable RAM region size.
 * @param[in] region_number RAM region number.
 * @param[in] lock_conf     Lock configuration until next SoC reset.
 */
NRF_STATIC_INLINE void nrf_spu_ramnsc_set(NRF_SPU_Type *     p_reg,
                                          uint8_t            ram_nsc_id,
                                          nrf_spu_nsc_size_t ram_nsc_size,
                                          uint8_t            region_number,
                                          bool               lock_conf);

/**
 * @brief Function for configuring security for a particular flash region.
 *
 * Permissions parameter must be set by using the logical OR on the @ref nrf_spu_mem_perm_t values.
 *
 * @param[in] p_reg       Pointer to the structure of registers of the peripheral.
 * @param[in] region_id   Flash region index.
 * @param[in] secure_attr Set region attribute to secure.
 * @param[in] permissions Flash region permissions.
 * @param[in] lock_conf   Lock configuration until next SoC reset.
 */
NRF_STATIC_INLINE void nrf_spu_flashregion_set(NRF_SPU_Type * p_reg,
                                               uint8_t        region_id,
                                               bool           secure_attr,
                                               uint32_t       permissions,
                                               bool           lock_conf);

/**
 * @brief Function for configuring security for the RAM region.
 *
 * Permissions parameter must be set by using the logical OR on the @ref nrf_spu_mem_perm_t values.
 *
 * @param[in] p_reg       Pointer to the structure of registers of the peripheral.
 * @param[in] region_id   RAM region index.
 * @param[in] secure_attr Set region attribute to secure.
 * @param[in] permissions RAM region permissions.
 * @param[in] lock_conf   Lock configuration until next SoC reset.
 */
NRF_STATIC_INLINE void nrf_spu_ramregion_set(NRF_SPU_Type * p_reg,
                                             uint8_t        region_id,
                                             bool           secure_attr,
                                             uint32_t       permissions,
                                             bool           lock_conf);

/**
 * @brief Function for configuring access permissions of the peripheral.
 *
 * @param[in] p_reg         Pointer to the structure of registers of the peripheral.
 * @param[in] peripheral_id ID number of a particular peripheral.
 * @param[in] secure_attr   Peripheral registers accessible only from secure domain.
 * @param[in] secure_dma    DMA transfers possible only from RAM memory in secure domain.
 * @param[in] lock_conf     Lock configuration until next SoC reset.
 */
NRF_STATIC_INLINE void nrf_spu_peripheral_set(NRF_SPU_Type * p_reg,
                                              uint32_t       peripheral_id,
                                              bool           secure_attr,
                                              bool           secure_dma,
                                              bool           lock_conf);

/**
 * @brief Function for configuring bus access permissions of the specified external domain.
 *
 * @param[in] p_reg       Pointer to the structure of registers of the peripheral.
 * @param[in] domain_id   ID number of a particular external domain.
 * @param[in] secure_attr Specifies if the bus accesses from this domain have the secure attribute set.
 * @param[in] lock_conf   Specifies if the configuration should be locked until next SoC reset.
 */
NRF_STATIC_INLINE void nrf_spu_extdomain_set(NRF_SPU_Type * p_reg,
                                             uint32_t       domain_id,
                                             bool           secure_attr,
                                             bool           lock_conf);
#endif

#if NRF_SPU_HAS_PERIPHERAL_ACCESS

/**
 * @brief Function for getting the address of the security violation.
 *
 * @note The event PERIPHACCERR must be cleared to clear this register.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @return Address of the transaction that caused first error.
 */
NRF_STATIC_INLINE uint32_t nrf_spu_periphaccerr_address_get(NRF_SPU_Type const * p_reg);

#if NRF_SPU_HAS_OWNERSHIP && NRF_SPU_HAS_PERIPHERAL_ACCESS_ERROR_INFO
/**
 * @brief Function for getting the owner ID of the security violation.
 *
 * @note The event PERIPHACCERR must be cleared to clear this register.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @return Owner ID of the transaction that caused first error.
 */
NRF_STATIC_INLINE nrf_owner_t nrf_spu_periphaccerr_ownerid_get(NRF_SPU_Type const * p_reg);
#endif

/**
 * @brief Function for getting the capabilities for TrustZone Cortex-M secure attribute
 *        of the specified slave.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] index Peripheral slave index.
 *
 * @return TrustZone capabilities.
 */
NRF_STATIC_INLINE
nrf_spu_securemapping_t nrf_spu_periph_perm_securemapping_get(NRF_SPU_Type const * p_reg,
                                                              uint8_t              index);

/**
 * @brief Function for getting the DMA capabilities of the specified slave.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] index Peripheral slave index.
 *
 * @return DMA capabilities.
 */
NRF_STATIC_INLINE nrf_spu_dma_t nrf_spu_periph_perm_dma_get(NRF_SPU_Type const * p_reg,
                                                            uint8_t              index);

/**
 * @brief Function for getting the security mapping of the specified slave.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] index Peripheral slave index.
 *
 * @retval true  Peripheral is mapped in secure peripheral address space.
 * @retval false If TrustZone capabilities are @ref NRF_SPU_SECUREMAPPING_USERSELECTABLE,
 *               then peripheral is mapped in non-secure peripheral address space.
 *               If TrustZone capabilities are @ref NRF_SPU_SECUREMAPPING_SPLIT,
 *               then peripheral is mapped in non-secure and secure peripheral address space.
 */
NRF_STATIC_INLINE bool nrf_spu_periph_perm_secattr_get(NRF_SPU_Type const * p_reg,
                                                       uint8_t              index);

/**
 * @brief Function for setting the security mapping of the specified slave.
 *
 * @note This bit has effect only if TrustZone capabilities are either
 *       @ref NRF_SPU_SECUREMAPPING_USERSELECTABLE or @ref NRF_SPU_SECUREMAPPING_SPLIT.
 *
 * @param[in] p_reg  Pointer to the structure of registers of the peripheral.
 * @param[in] index  Peripheral slave index.
 * @param[in] enable True if security mapping is to be set, false otherwise.
 */
NRF_STATIC_INLINE void nrf_spu_periph_perm_secattr_set(NRF_SPU_Type * p_reg,
                                                       uint8_t        index,
                                                       bool           enable);

