pillo79/ArduinoCore-zephyr/variants/arduino_nano_33_ble_nrf52840_sense/llext-edk/include/modules/hal/nordic/nrfx/hal/nrf_spu.h
/**
 * @brief Function for getting the security attribution for the DMA transfer
 *        of the specified slave.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] index Peripheral slave index.
 *
 * @return True if DMA transfers initiated by this peripheral have the secure attribute set,
 *         false otherwise.
 */
NRF_STATIC_INLINE bool nrf_spu_periph_perm_dmasec_get(NRF_SPU_Type const * p_reg,
                                                      uint8_t              index);

/**
 * @brief Function for setting the security attribution for the DMA transfer
 *        of the specified slave.
 *
 * @note This bit has effect only if peripheral security mapping is enabled.
 *
 * @param[in] p_reg  Pointer to the structure of registers of the peripheral.
 * @param[in] index  Peripheral slave index.
 * @param[in] enable True if secure attribute for the DMA transfer is to be set, false otherwise.
 */
NRF_STATIC_INLINE void nrf_spu_periph_perm_dmasec_set(NRF_SPU_Type * p_reg,
                                                      uint8_t        index,
                                                      bool           enable);

#if NRF_SPU_HAS_BLOCK
/**
 * @brief Function for getting the status of the peripheral access lock of the specified slave.
 *
 * @note When peripheral access lock is enabled, reading or modifying the registers of the peripheral
 *       is blocked.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] index Peripheral slave index.
 *
 * @return True if the peripheral access is locked, false otherwise.
 */
NRF_STATIC_INLINE bool nrf_spu_periph_perm_block_get(NRF_SPU_Type const * p_reg,
                                                     uint8_t              index);

/**
 * @brief Function for enabling the peripheral access lock of the specified slave.
 *
 * @note When peripheral access lock is enabled, reading or modifying the registers of the peripheral
 *       is blocked.
 *
 * @param[in] p_reg  Pointer to the structure of registers of the peripheral.
 * @param[in] index  Peripheral slave index.
 */
NRF_STATIC_INLINE void nrf_spu_periph_perm_block_enable(NRF_SPU_Type * p_reg,
                                                        uint8_t        index);
#endif

/**
 * @brief Function for getting the status of the peripheral management lock of the specified slave.
 *
 * @note When peripheral management lock is enabled, modifying the SPU configuration associated
 *       with specified peripheral is not possible.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] index Peripheral slave index.
 *
 * @return True if the peripheral management is locked, false otherwise.
 */
NRF_STATIC_INLINE bool nrf_spu_periph_perm_lock_get(NRF_SPU_Type const * p_reg,
                                                    uint8_t              index);

/**
 * @brief Function for enabling the peripheral management lock of the specified slave.
 *
 * @note When peripheral management lock is enabled, modifying the SPU configuration associated
 *       with specified peripheral is not possible.
 *
 * @param[in] p_reg  Pointer to the structure of registers of the peripheral.
 * @param[in] index  Peripheral slave index.
 */
NRF_STATIC_INLINE void nrf_spu_periph_perm_lock_enable(NRF_SPU_Type * p_reg,
                                                       uint8_t        index);

#if NRF_SPU_HAS_OWNERSHIP
/**
 * @brief Function for getting the peripheral owner ID of the specified slave.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] index Peripheral slave index.
 *
 * @return Owner ID.
 */
NRF_STATIC_INLINE nrf_owner_t nrf_spu_periph_perm_ownerid_get(NRF_SPU_Type const * p_reg,
                                                              uint8_t              index);

/**
 * @brief Function for setting the peripheral owner ID of the specified slave.
 *
 * @param[in] p_reg    Pointer to the structure of registers of the peripheral.
 * @param[in] index    Peripheral slave index.
 * @param[in] owner_id Owner ID to be set.
 */
NRF_STATIC_INLINE void nrf_spu_periph_perm_ownerid_set(NRF_SPU_Type * p_reg,
                                                       uint8_t        index,
                                                       nrf_owner_t    owner_id);

/**
 * @brief Function for getting the indication if owner ID of the specified slave
 *        is programmable or not.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] index Peripheral slave index.
 *
 * @return True if owner ID is programmable, false otherwise.
 */
NRF_STATIC_INLINE bool nrf_spu_periph_perm_ownerprog_get(NRF_SPU_Type const * p_reg,
                                                         uint8_t              index);
#endif // #if NRF_SPU_HAS_OWNERSHIP

/**
 * @brief Function for getting the indication if peripheral with
 *        the specified slave index is present.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] index Peripheral slave index.
 *
 * @return True if peripheral is present, false otherwise.
 */
NRF_STATIC_INLINE bool nrf_spu_periph_perm_present_get(NRF_SPU_Type const * p_reg,
                                                       uint8_t              index);

/**
 * @brief Function for getting the security mapping of the specified feature.
 *
 * @param[in] p_reg    Pointer to the structure of registers of the peripheral.
 * @param[in] feature  Feature to be accessed.
 * @param[in] index    Feature index.
 * @param[in] subindex Feature subindex. Only used for applicable features, otherwise skipped.
 *
 * @retval true  Feature is available for secure usage.
 * @retval false Feature is available for non-secure usage.
 */
NRF_STATIC_INLINE bool nrf_spu_feature_secattr_get(NRF_SPU_Type const * p_reg,
                                                   nrf_spu_feature_t    feature,
                                                   uint8_t              index,
                                                   uint8_t              subindex);

/**
 * @brief Function for setting the security mapping of the specified feature.
 *
 * @param[in] p_reg    Pointer to the structure of registers of the peripheral.
 * @param[in] feature  Feature to be accessed.
 * @param[in] index    Feature index.
 * @param[in] subindex Feature subindex. Only used for applicable features, otherwise skipped.
 * @param[in] enable   True if security mapping is to be set, false otherwise.
 */
NRF_STATIC_INLINE void nrf_spu_feature_secattr_set(NRF_SPU_Type *    p_reg,
                                                   nrf_spu_feature_t feature,
                                                   uint8_t           index,
                                                   uint8_t           subindex,
                                                   bool              enable);

/**
 * @brief Function for getting the status of the management lock of the specified feature.
 *
 * @note When feature management lock is enabled, modifying the SPU configuration associated
 *       with specified feature is not possible.
 *
 * @param[in] p_reg    Pointer to the structure of registers of the peripheral.
 * @param[in] feature  Feature to be accessed.
 * @param[in] index    Feature index.
 * @param[in] subindex Feature subindex. Only used for applicable features, otherwise skipped.
 *
 * @return True if feature management is locked, false otherwise.
 */
NRF_STATIC_INLINE bool nrf_spu_feature_lock_get(NRF_SPU_Type const * p_reg,
                                                nrf_spu_feature_t    feature,
                                                uint8_t              index,
                                                uint8_t              subindex);

/**
 * @brief Function for enabling the management lock of the specified feature.
 *
 * @note When feature management lock is enabled, modifying the SPU configuration associated
 *       with specified feature is not possible.
 *
 * @param[in] p_reg    Pointer to the structure of registers of the peripheral.
 * @param[in] feature  Feature to be accessed.
 * @param[in] index    Feature index.
 * @param[in] subindex Feature subindex. Only used for applicable features, otherwise skipped.
 */
NRF_STATIC_INLINE void nrf_spu_feature_lock_enable(NRF_SPU_Type *    p_reg,
                                                   nrf_spu_feature_t feature,
                                                   uint8_t           index,
                                                   uint8_t           subindex);

