pillo79/ArduinoCore-zephyr/variants/arduino_nano_33_ble_nrf52840_sense/llext-edk/include/modules/hal/nordic/nrfx/hal/nrf_spu.h
#if NRF_SPU_HAS_BLOCK
/**
 * @brief Function for getting status of the access lock of the specified feature.
 *
 * @note When feature access lock is enabled, reading or modifying the registers of the feature
 *       is blocked.
 *
 * @param[in] p_reg    Pointer to the structure of registers of the peripheral.
 * @param[in] feature  Feature to be accessed.
 * @param[in] index    Feature index.
 * @param[in] subindex Feature subindex. Only used for applicable features, otherwise skipped.
 *
 * @return True if the feature access is locked, false otherwise.
 */
NRF_STATIC_INLINE bool nrf_spu_feature_block_get(NRF_SPU_Type const * p_reg,
                                                 nrf_spu_feature_t    feature,
                                                 uint8_t              index,
                                                 uint8_t              subindex);

/**
 * @brief Function for enabling the feature block of the specified feature.
 *
 * @note When feature access lock is enabled, reading or modifying the registers of the feature
 *       is blocked.
 *
 * @param[in] p_reg    Pointer to the structure of registers of the peripheral.
 * @param[in] feature  Feature to be accessed.
 * @param[in] index    Feature index.
 * @param[in] subindex Feature subindex. Only used for applicable features, otherwise skipped.
 */
NRF_STATIC_INLINE void nrf_spu_feature_block_enable(NRF_SPU_Type *    p_reg,
                                                    nrf_spu_feature_t feature,
                                                    uint8_t           index,
                                                    uint8_t           subindex);
#endif

#if NRF_SPU_HAS_OWNERSHIP
/**
 * @brief Function for getting the feature owner ID of the specified feature.
 *
 * @param[in] p_reg    Pointer to the structure of registers of the peripheral.
 * @param[in] feature  Feature to be accessed.
 * @param[in] index    Feature index.
 * @param[in] subindex Feature subindex. Only used for applicable features, otherwise skipped.
 *
 * @return Owner ID.
 */
NRF_STATIC_INLINE nrf_owner_t nrf_spu_feature_ownerid_get(NRF_SPU_Type const * p_reg,
                                                          nrf_spu_feature_t    feature,
                                                          uint8_t              index,
                                                          uint8_t              subindex);

/**
 * @brief Function for setting the feature owner ID of the specified feature.
 *
 * @param[in] p_reg    Pointer to the structure of registers of the peripheral.
 * @param[in] feature  Feature to be accessed.
 * @param[in] index    Feature index.
 * @param[in] subindex Feature subindex. Only used for applicable features, otherwise skipped.
 * @param[in] owner_id Owner ID to be set.
 */
NRF_STATIC_INLINE void nrf_spu_feature_ownerid_set(NRF_SPU_Type *    p_reg,
                                                   nrf_spu_feature_t feature,
                                                   uint8_t           index,
                                                   uint8_t           subindex,
                                                   nrf_owner_t       owner_id);
#endif // NRF_SPU_HAS_OWNERSHIP
#endif // NRF_SPU_HAS_PERIPHERAL_ACCESS

#ifndef NRF_DECLARE_ONLY

NRF_STATIC_INLINE void nrf_spu_event_clear(NRF_SPU_Type *  p_reg,
                                           nrf_spu_event_t event)
{
    *((volatile uint32_t *)((uint8_t *)p_reg + (uint32_t)event)) = 0x0UL;
    nrf_event_readback((uint8_t *)p_reg + (uint32_t)event);
}

NRF_STATIC_INLINE bool nrf_spu_event_check(NRF_SPU_Type const * p_reg,
                                           nrf_spu_event_t      event)
{
    return nrf_event_check(p_reg, event);
}

NRF_STATIC_INLINE void nrf_spu_int_enable(NRF_SPU_Type * p_reg,
                                          uint32_t       mask)
{
    p_reg->INTENSET = mask;
}

NRF_STATIC_INLINE void nrf_spu_int_disable(NRF_SPU_Type * p_reg,
                                           uint32_t       mask)
{
    p_reg->INTENCLR = mask;
}

NRF_STATIC_INLINE uint32_t nrf_spu_int_enable_check(NRF_SPU_Type const * p_reg, uint32_t mask)
{
    return p_reg->INTENSET & mask;
}

#if NRF_SPU_HAS_MEMORY
NRF_STATIC_INLINE void nrf_spu_publish_set(NRF_SPU_Type *  p_reg,
                                           nrf_spu_event_t event,
                                           uint32_t        channel)
{
    *((volatile uint32_t *) ((uint8_t *) p_reg + (uint32_t) event + 0x80uL)) =
        (channel | (NRF_SUBSCRIBE_PUBLISH_ENABLE));
}

NRF_STATIC_INLINE void nrf_spu_publish_clear(NRF_SPU_Type *  p_reg,
                                             nrf_spu_event_t event)
{
    *((volatile uint32_t *) ((uint8_t *) p_reg + (uint32_t) event + 0x80uL)) = 0;
}

NRF_STATIC_INLINE bool nrf_spu_tz_is_available(NRF_SPU_Type const * p_reg)
{
    return (p_reg->CAP & SPU_CAP_TZM_Msk ? true : false);
}

NRF_STATIC_INLINE void nrf_spu_dppi_config_set(NRF_SPU_Type * p_reg,
                                               uint8_t        dppi_id,
                                               uint32_t       channels_mask,
                                               bool           lock_conf)
{
    NRFX_ASSERT(!(p_reg->DPPI[dppi_id].LOCK & SPU_DPPI_LOCK_LOCK_Msk));

    p_reg->DPPI[dppi_id].PERM = channels_mask;

    if (lock_conf)
    {
        p_reg->DPPI[dppi_id].LOCK = (SPU_DPPI_LOCK_LOCK_Msk);
    }
}

NRF_STATIC_INLINE void nrf_spu_gpio_config_set(NRF_SPU_Type * p_reg,
                                               uint8_t        gpio_port,
                                               uint32_t       gpio_mask,
                                               bool           lock_conf)
{
    NRFX_ASSERT(!(p_reg->GPIOPORT[gpio_port].LOCK & SPU_GPIOPORT_LOCK_LOCK_Msk));

    p_reg->GPIOPORT[gpio_port].PERM = gpio_mask;

    if (lock_conf)
    {
        p_reg->GPIOPORT[gpio_port].LOCK = (SPU_GPIOPORT_LOCK_LOCK_Msk);
    }
}

NRF_STATIC_INLINE void nrf_spu_flashnsc_set(NRF_SPU_Type *     p_reg,
                                            uint8_t            flash_nsc_id,
                                            nrf_spu_nsc_size_t flash_nsc_size,
                                            uint8_t            region_number,
                                            bool               lock_conf)
{
    NRFX_ASSERT(!(p_reg->FLASHNSC[flash_nsc_id].REGION & SPU_FLASHNSC_REGION_LOCK_Msk));
    NRFX_ASSERT(!(p_reg->FLASHNSC[flash_nsc_id].SIZE & SPU_FLASHNSC_SIZE_LOCK_Msk));

    p_reg->FLASHNSC[flash_nsc_id].REGION = (uint32_t)region_number |
        (lock_conf ? SPU_FLASHNSC_REGION_LOCK_Msk : 0);
    p_reg->FLASHNSC[flash_nsc_id].SIZE = (uint32_t)flash_nsc_size |
        (lock_conf ? SPU_FLASHNSC_SIZE_LOCK_Msk : 0);
}

