pillo79/ArduinoCore-zephyr/variants/arduino_nano_33_ble_nrf52840_sense/llext-edk/include/modules/hal/nordic/nrfx/hal/nrf_spu.h
#if NRF_SPU_HAS_BLOCK
NRF_STATIC_INLINE void nrf_spu_periph_perm_block_enable(NRF_SPU_Type * p_reg,
                                                        uint8_t        index)
{
    NRFX_ASSERT(index < NRF_SPU_PERIPH_COUNT);
    p_reg->PERIPH[index].PERM = ((p_reg->PERIPH[index].PERM & ~SPU_PERIPH_PERM_BLOCK_Msk)
                                 | (SPU_PERIPH_PERM_BLOCK_Blocked <<
                                    SPU_PERIPH_PERM_BLOCK_Pos));
}
#endif

NRF_STATIC_INLINE void nrf_spu_periph_perm_dmasec_set(NRF_SPU_Type * p_reg,
                                                      uint8_t        index,
                                                      bool           enable)
{
    NRFX_ASSERT(index < NRF_SPU_PERIPH_COUNT);
    p_reg->PERIPH[index].PERM = ((p_reg->PERIPH[index].PERM & ~SPU_PERIPH_PERM_DMASEC_Msk)
                                 | ((enable ? SPU_PERIPH_PERM_DMASEC_Secure :
                                     SPU_PERIPH_PERM_DMASEC_NonSecure) <<
                                    SPU_PERIPH_PERM_DMASEC_Pos));
}

NRF_STATIC_INLINE void nrf_spu_periph_perm_secattr_set(NRF_SPU_Type * p_reg,
                                                       uint8_t        index,
                                                       bool           enable)
{
    NRFX_ASSERT(index < NRF_SPU_PERIPH_COUNT);
    p_reg->PERIPH[index].PERM = ((p_reg->PERIPH[index].PERM & ~SPU_PERIPH_PERM_SECATTR_Msk)
                                 | ((enable ? SPU_PERIPH_PERM_SECATTR_Secure :
                                     SPU_PERIPH_PERM_SECATTR_NonSecure) <<
                                    SPU_PERIPH_PERM_SECATTR_Pos));
}

NRF_STATIC_INLINE
nrf_spu_securemapping_t nrf_spu_periph_perm_securemapping_get(NRF_SPU_Type const * p_reg,
                                                              uint8_t              index)
{
    NRFX_ASSERT(index < NRF_SPU_PERIPH_COUNT);

    return (nrf_spu_securemapping_t)((p_reg->PERIPH[index].PERM
                                      & SPU_PERIPH_PERM_SECUREMAPPING_Msk) >>
                                     SPU_PERIPH_PERM_SECUREMAPPING_Pos);
}

NRF_STATIC_INLINE nrf_spu_dma_t nrf_spu_periph_perm_dma_get(NRF_SPU_Type const * p_reg,
                                                            uint8_t              index)
{
    NRFX_ASSERT(index < NRF_SPU_PERIPH_COUNT);

    return (nrf_spu_dma_t)((p_reg->PERIPH[index].PERM & SPU_PERIPH_PERM_DMA_Msk) >>
                           SPU_PERIPH_PERM_DMA_Pos);
}

#if NRF_SPU_HAS_OWNERSHIP
NRF_STATIC_INLINE nrf_owner_t nrf_spu_periph_perm_ownerid_get(NRF_SPU_Type const * p_reg,
                                                              uint8_t              index)
{
    NRFX_ASSERT(index < NRF_SPU_PERIPH_COUNT);

    return (nrf_owner_t)((p_reg->PERIPH[index].PERM & SPU_PERIPH_PERM_OWNERID_Msk) >>
                         SPU_PERIPH_PERM_OWNERID_Pos);
}

NRF_STATIC_INLINE void nrf_spu_periph_perm_ownerid_set(NRF_SPU_Type * p_reg,
                                                       uint8_t        index,
                                                       nrf_owner_t    owner_id)
{
    NRFX_ASSERT(index < NRF_SPU_PERIPH_COUNT);

    p_reg->PERIPH[index].PERM = ((p_reg->PERIPH[index].PERM & ~SPU_PERIPH_PERM_OWNERID_Msk) |
                                 ((owner_id << SPU_PERIPH_PERM_OWNERID_Pos)
                                  & SPU_PERIPH_PERM_OWNERID_Msk));
}
#endif

NRF_STATIC_INLINE bool nrf_spu_feature_secattr_get(NRF_SPU_Type const * p_reg,
                                                   nrf_spu_feature_t    feature,
                                                   uint8_t              index,
                                                   uint8_t              subindex)
{
    switch (feature)
    {
#if NRF_SPU_HAS_IPCT
        case NRF_SPU_FEATURE_IPCT_CHANNEL:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_IPCT_CHANNEL_COUNT);
            return (p_reg->FEATURE.IPCT.CH[index]
                    & SPU_FEATURE_IPCT_CH_SECATTR_Msk)
                   >> SPU_FEATURE_IPCT_CH_SECATTR_Pos;

        case NRF_SPU_FEATURE_IPCT_INTERRUPT:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_IPCT_INTERRUPT_COUNT);
            return (p_reg->FEATURE.IPCT.INTERRUPT[index]
                    & SPU_FEATURE_IPCT_INTERRUPT_SECATTR_Msk)
                   >> SPU_FEATURE_IPCT_INTERRUPT_SECATTR_Pos;
#endif // NRF_SPU_HAS_IPCT

        case NRF_SPU_FEATURE_DPPI_CHANNEL:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_DPPI_CHANNEL_COUNT);
            return (p_reg->FEATURE.DPPIC.CH[index]
                    & SPU_FEATURE_DPPIC_CH_SECATTR_Msk)
                   >> SPU_FEATURE_DPPIC_CH_SECATTR_Pos;

        case NRF_SPU_FEATURE_DPPI_CHANNEL_GROUP:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_DPPI_CHANNEL_GROUP_COUNT);
            return (p_reg->FEATURE.DPPIC.CHG[index]
                    & SPU_FEATURE_DPPIC_CHG_SECATTR_Msk)
                   >> SPU_FEATURE_DPPIC_CHG_SECATTR_Pos;

        case NRF_SPU_FEATURE_GPIOTE_CHANNEL:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_GPIOTE_COUNT);
            NRFX_ASSERT(subindex < NRF_SPU_FEATURE_GPIOTE_CHANNEL_COUNT);
            return (p_reg->FEATURE.GPIOTE[index].CH[subindex]
                    & SPU_FEATURE_GPIOTE_CH_SECATTR_Msk)
                   >> SPU_FEATURE_GPIOTE_CH_SECATTR_Pos;

        case NRF_SPU_FEATURE_GPIOTE_INTERRUPT:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_GPIOTE_COUNT);
            NRFX_ASSERT(subindex < NRF_SPU_FEATURE_GPIOTE_INTERRUPT_COUNT);
            return (p_reg->FEATURE.GPIOTE[index].INTERRUPT[subindex]
                    & SPU_FEATURE_GPIOTE_INTERRUPT_SECATTR_Msk)
                   >> SPU_FEATURE_GPIOTE_INTERRUPT_SECATTR_Pos;

        case NRF_SPU_FEATURE_GPIO_PIN:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_GPIO_COUNT);
            NRFX_ASSERT(subindex < NRF_SPU_FEATURE_GPIO_PIN_COUNT);
            return (p_reg->FEATURE.GPIO[index].PIN[subindex]
                    & SPU_FEATURE_GPIO_PIN_SECATTR_Msk)
                   >> SPU_FEATURE_GPIO_PIN_SECATTR_Pos;

        case NRF_SPU_FEATURE_GRTC_CC:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_GRTC_CC_COUNT);
            return (p_reg->FEATURE.GRTC.CC[index]
                    & SPU_FEATURE_GRTC_CC_SECATTR_Msk)
                   >> SPU_FEATURE_GRTC_CC_SECATTR_Pos;

        case NRF_SPU_FEATURE_GRTC_SYSCOUNTER:
            return (p_reg->FEATURE.GRTC.SYSCOUNTER
                    & SPU_FEATURE_GRTC_SYSCOUNTER_SECATTR_Msk)
                   >> SPU_FEATURE_GRTC_SYSCOUNTER_SECATTR_Pos;

