pillo79/ArduinoCore-zephyr/variants/arduino_nano_33_ble_nrf52840_sense/llext-edk/include/modules/hal/nordic/nrfx/hal/nrf_spu.h
        case NRF_SPU_FEATURE_GRTC_INTERRUPT:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_GRTC_INTERRUPT_COUNT);
            return (p_reg->FEATURE.GRTC.INTERRUPT[index]
                    & SPU_FEATURE_GRTC_INTERRUPT_BLOCK_Msk)
                   >> SPU_FEATURE_GRTC_INTERRUPT_BLOCK_Pos;

#if NRF_SPU_HAS_BELLS
#if NRF_SPU_HAS_DOMAIN
        case NRF_SPU_FEATURE_BELLS_BELL:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_BELL_BELL_COUNT);
            return (p_reg->FEATURE.BELLS.DOMAIN[index].BELL[subindex]
                    & SPU_FEATURE_BELLS_DOMAIN_BELL_BLOCK_Msk)
                   >> SPU_FEATURE_BELLS_DOMAIN_BELL_BLOCK_Pos;
#else
        case NRF_SPU_FEATURE_BELLS_TASKS:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_BELLS_TASKS_COUNT);
            return (p_reg->FEATURE.BELLS.PROCESSOR[index].TASKS[subindex]
                    & SPU_FEATURE_BELLS_PROCESSOR_TASKS_BLOCK_Msk)
                   >> SPU_FEATURE_BELLS_PROCESSOR_TASKS_BLOCK_Pos;

        case NRF_SPU_FEATURE_BELLS_EVENTS:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_BELLS_EVENTS_COUNT);
            return (p_reg->FEATURE.BELLS.PROCESSOR[index].EVENTS[subindex]
                    & SPU_FEATURE_BELLS_PROCESSOR_EVENTS_BLOCK_Msk)
                   >> SPU_FEATURE_BELLS_PROCESSOR_EVENTS_BLOCK_Pos;

        case NRF_SPU_FEATURE_BELLS_INTERRUPT:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_BELLS_INTERRUPT_COUNT);
            return (p_reg->FEATURE.BELLS.PROCESSOR[index].INTERRUPT[subindex]
                    & SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_BLOCK_Msk)
                   >> SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_BLOCK_Pos;
#endif // NRF_SPU_HAS_DOMAIN
#endif // NRF_SPU_HAS_BELLS

#if NRF_SPU_HAS_TDD
        case NRF_SPU_FEATURE_TDD:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_TDD_COUNT);
            return (p_reg->FEATURE.TDD[index]
                    & SPU_FEATURE_TDD_BLOCK_Msk)
                   >> SPU_FEATURE_TDD_BLOCK_Pos;
#endif // NRF_SPU_HAS_TDD

#if NRF_SPU_HAS_MRAMC
        case NRF_SPU_FEATURE_MRAMC_WAITSTATES:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_MRAMC_COUNT);
            return (p_reg->FEATURE.MRAMC[index].WAITSTATES
                    & SPU_FEATURE_MRAMC_WAITSTATES_BLOCK_Msk)
                   >> SPU_FEATURE_MRAMC_WAITSTATES_BLOCK_Pos;

        case NRF_SPU_FEATURE_MRAMC_AUTODPOWERDOWN:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_MRAMC_COUNT);
            return (p_reg->FEATURE.MRAMC[index].AUTODPOWERDOWN
                    & SPU_FEATURE_MRAMC_AUTODPOWERDOWN_BLOCK_Msk)
                   >> SPU_FEATURE_MRAMC_AUTODPOWERDOWN_BLOCK_Pos;

        case NRF_SPU_FEATURE_MRAMC_READY:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_MRAMC_COUNT);
            return (p_reg->FEATURE.MRAMC[index].READY
                    & SPU_FEATURE_MRAMC_READY_BLOCK_Msk)
                   >> SPU_FEATURE_MRAMC_READY_BLOCK_Pos;
#endif // NRF_SPU_HAS_MRAMC

        default:
            NRFX_ASSERT(0);
            return false;
    }
}
#endif // NRF_SPU_HAS_BLOCK

#if NRF_SPU_HAS_OWNERSHIP
NRF_STATIC_INLINE nrf_owner_t nrf_spu_feature_ownerid_get(NRF_SPU_Type const * p_reg,
                                                          nrf_spu_feature_t    feature,
                                                          uint8_t              index,
                                                          uint8_t              subindex)
{
    switch (feature)
    {
#if NRF_SPU_HAS_IPCT
        case NRF_SPU_FEATURE_IPCT_CHANNEL:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_IPCT_CHANNEL_COUNT);
            return (nrf_owner_t)((p_reg->FEATURE.IPCT.CH[index]
                                  & SPU_FEATURE_IPCT_CH_OWNERID_Msk)
                                 >> SPU_FEATURE_IPCT_CH_OWNERID_Pos);

        case NRF_SPU_FEATURE_IPCT_INTERRUPT:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_IPCT_INTERRUPT_COUNT);
            return (nrf_owner_t)((p_reg->FEATURE.IPCT.INTERRUPT[index]
                                  & SPU_FEATURE_IPCT_INTERRUPT_OWNERID_Msk)
                                 >> SPU_FEATURE_IPCT_INTERRUPT_OWNERID_Pos);
#endif // NRF_SPU_HAS_IPCT

        case NRF_SPU_FEATURE_DPPI_CHANNEL:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_DPPI_CHANNEL_COUNT);
            return (nrf_owner_t)((p_reg->FEATURE.DPPIC.CH[index]
                                  & SPU_FEATURE_DPPIC_CH_OWNERID_Msk)
                                 >> SPU_FEATURE_DPPIC_CH_OWNERID_Pos);

        case NRF_SPU_FEATURE_DPPI_CHANNEL_GROUP:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_DPPI_CHANNEL_GROUP_COUNT);
            return (nrf_owner_t)((p_reg->FEATURE.DPPIC.CHG[index]
                                  & SPU_FEATURE_DPPIC_CHG_OWNERID_Msk)
                                 >> SPU_FEATURE_DPPIC_CHG_OWNERID_Pos);

        case NRF_SPU_FEATURE_GPIOTE_CHANNEL:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_GPIOTE_COUNT);
            NRFX_ASSERT(subindex < NRF_SPU_FEATURE_GPIOTE_CHANNEL_COUNT);
            return (nrf_owner_t)((p_reg->FEATURE.GPIOTE[index].CH[subindex]
                                  & SPU_FEATURE_GPIOTE_CH_OWNERID_Msk)
                                 >> SPU_FEATURE_GPIOTE_CH_OWNERID_Pos);

        case NRF_SPU_FEATURE_GPIOTE_INTERRUPT:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_GPIOTE_COUNT);
            NRFX_ASSERT(subindex < NRF_SPU_FEATURE_GPIOTE_INTERRUPT_COUNT);
            return (nrf_owner_t)((p_reg->FEATURE.GPIOTE[index].INTERRUPT[subindex]
                                  & SPU_FEATURE_GPIOTE_INTERRUPT_OWNERID_Msk)
                                 >> SPU_FEATURE_GPIOTE_INTERRUPT_OWNERID_Pos);

        case NRF_SPU_FEATURE_GPIO_PIN:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_GPIO_COUNT);
            NRFX_ASSERT(subindex < NRF_SPU_FEATURE_GPIO_PIN_COUNT);
            return (nrf_owner_t)((p_reg->FEATURE.GPIO[index].PIN[subindex]
                                  & SPU_FEATURE_GPIO_PIN_OWNERID_Msk)
                                 >> SPU_FEATURE_GPIO_PIN_OWNERID_Pos);

        case NRF_SPU_FEATURE_GRTC_CC:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_GRTC_CC_COUNT);
            return (nrf_owner_t)((p_reg->FEATURE.GRTC.CC[index]
                                  & SPU_FEATURE_GRTC_CC_OWNERID_Msk)
                                 >> SPU_FEATURE_GRTC_CC_OWNERID_Pos);

        case NRF_SPU_FEATURE_GRTC_SYSCOUNTER:
            return (nrf_owner_t)((p_reg->FEATURE.GRTC.SYSCOUNTER
                                  & SPU_FEATURE_GRTC_SYSCOUNTER_OWNERID_Msk)
                                 >> SPU_FEATURE_GRTC_SYSCOUNTER_OWNERID_Pos);

