pillo79/ArduinoCore-zephyr/variants/arduino_nano_33_ble_nrf52840_sense/llext-edk/include/modules/hal/nordic/nrfx/hal/nrf_spu.h
        case NRF_SPU_FEATURE_GRTC_INTERRUPT:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_GRTC_INTERRUPT_COUNT);
            return (nrf_owner_t)((p_reg->FEATURE.GRTC.INTERRUPT[index]
                                  & SPU_FEATURE_GRTC_INTERRUPT_OWNERID_Msk)
                                 >> SPU_FEATURE_GRTC_INTERRUPT_OWNERID_Pos);

#if NRF_SPU_HAS_BELLS
#if NRF_SPU_HAS_DOMAIN
        case NRF_SPU_FEATURE_BELLS_BELL:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_BELL_BELL_COUNT);
            return (nrf_owner_t)((p_reg->FEATURE.BELLS.DOMAIN[index].BELL[subindex]
                    & SPU_FEATURE_BELLS_DOMAIN_BELL_OWNERID_Msk)
                   >> SPU_FEATURE_BELLS_DOMAIN_BELL_OWNERID_Pos);
#else
        case NRF_SPU_FEATURE_BELLS_TASKS:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_BELLS_TASKS_COUNT);
            return (nrf_owner_t)((p_reg->FEATURE.BELLS.PROCESSOR[index].TASKS[subindex]
                    & SPU_FEATURE_BELLS_PROCESSOR_TASKS_OWNERID_Msk)
                   >> SPU_FEATURE_BELLS_PROCESSOR_TASKS_OWNERID_Pos);

        case NRF_SPU_FEATURE_BELLS_EVENTS:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_BELLS_EVENTS_COUNT);
            return (nrf_owner_t)((p_reg->FEATURE.BELLS.PROCESSOR[index].EVENTS[subindex]
                    & SPU_FEATURE_BELLS_PROCESSOR_EVENTS_OWNERID_Msk)
                   >> SPU_FEATURE_BELLS_PROCESSOR_EVENTS_OWNERID_Pos);

        case NRF_SPU_FEATURE_BELLS_INTERRUPT:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_BELLS_INTERRUPT_COUNT);
            return (nrf_owner_t)((p_reg->FEATURE.BELLS.PROCESSOR[index].INTERRUPT[subindex]
                    & SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_OWNERID_Msk)
                   >> SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_OWNERID_Pos);
#endif // NRF_SPU_HAS_DOMAIN
#endif // NRF_SPU_HAS_BELLS

#if NRF_SPU_HAS_TDD
        case NRF_SPU_FEATURE_TDD:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_TDD_COUNT);
            return (nrf_owner_t)((p_reg->FEATURE.TDD[index]
                    & SPU_FEATURE_TDD_OWNERID_Msk)
                   >> SPU_FEATURE_TDD_OWNERID_Pos);
#endif // NRF_SPU_HAS_TDD

#if NRF_SPU_HAS_MRAMC
        case NRF_SPU_FEATURE_MRAMC_WAITSTATES:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_MRAMC_COUNT);
            return (nrf_owner_t)((p_reg->FEATURE.MRAMC[index].WAITSTATES
                    & SPU_FEATURE_MRAMC_WAITSTATES_OWNERID_Msk)
                   >> SPU_FEATURE_MRAMC_WAITSTATES_OWNERID_Pos);

        case NRF_SPU_FEATURE_MRAMC_AUTODPOWERDOWN:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_MRAMC_COUNT);
            return (nrf_owner_t)((p_reg->FEATURE.MRAMC[index].AUTODPOWERDOWN
                    & SPU_FEATURE_MRAMC_AUTODPOWERDOWN_OWNERID_Msk)
                   >> SPU_FEATURE_MRAMC_AUTODPOWERDOWN_OWNERID_Pos);

        case NRF_SPU_FEATURE_MRAMC_READY:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_MRAMC_COUNT);
            return (nrf_owner_t)((p_reg->FEATURE.MRAMC[index].READY
                    & SPU_FEATURE_MRAMC_READY_OWNERID_Msk)
                   >> SPU_FEATURE_MRAMC_READY_OWNERID_Pos);
#endif // NRF_SPU_HAS_MRAMC

        default:
            NRFX_ASSERT(0);
            return (nrf_owner_t)0;
    }
}
#endif // NRF_SPU_HAS_OWNERSHIP

NRF_STATIC_INLINE void nrf_spu_feature_secattr_set(NRF_SPU_Type *    p_reg,
                                                   nrf_spu_feature_t feature,
                                                   uint8_t           index,
                                                   uint8_t           subindex,
                                                   bool              enable)
{
    switch (feature)
    {
#if NRF_SPU_HAS_IPCT
        case NRF_SPU_FEATURE_IPCT_CHANNEL:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_IPCT_CHANNEL_COUNT);
            p_reg->FEATURE.IPCT.CH[index] =
                ((p_reg->FEATURE.IPCT.CH[index] &
                  ~SPU_FEATURE_IPCT_CH_SECATTR_Msk) |
                 ((enable ?
                   SPU_FEATURE_IPCT_CH_SECATTR_Secure :
                   SPU_FEATURE_IPCT_CH_SECATTR_NonSecure)
                  << SPU_FEATURE_IPCT_CH_SECATTR_Pos));
            break;

        case NRF_SPU_FEATURE_IPCT_INTERRUPT:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_IPCT_INTERRUPT_COUNT);
            p_reg->FEATURE.IPCT.INTERRUPT[index] =
                ((p_reg->FEATURE.IPCT.INTERRUPT[index] &
                  ~SPU_FEATURE_IPCT_INTERRUPT_SECATTR_Msk) |
                 ((enable ?
                   SPU_FEATURE_IPCT_INTERRUPT_SECATTR_Secure :
                   SPU_FEATURE_IPCT_INTERRUPT_SECATTR_NonSecure)
                  <<  SPU_FEATURE_IPCT_INTERRUPT_SECATTR_Pos));
            break;
#endif // NRF_SPU_HAS_IPCT

        case NRF_SPU_FEATURE_DPPI_CHANNEL:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_DPPI_CHANNEL_COUNT);
            p_reg->FEATURE.DPPIC.CH[index] =
                ((p_reg->FEATURE.DPPIC.CH[index] &
                  ~SPU_FEATURE_DPPIC_CH_SECATTR_Msk) |
                 ((enable ?
                   SPU_FEATURE_DPPIC_CH_SECATTR_Secure :
                   SPU_FEATURE_DPPIC_CH_SECATTR_NonSecure)
                  <<  SPU_FEATURE_DPPIC_CH_SECATTR_Pos));
            break;

        case NRF_SPU_FEATURE_DPPI_CHANNEL_GROUP:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_DPPI_CHANNEL_GROUP_COUNT);
            p_reg->FEATURE.DPPIC.CHG[index] =
                ((p_reg->FEATURE.DPPIC.CHG[index] &
                  ~SPU_FEATURE_DPPIC_CHG_SECATTR_Msk) |
                 ((enable ?
                   SPU_FEATURE_DPPIC_CHG_SECATTR_Secure :
                   SPU_FEATURE_DPPIC_CHG_SECATTR_NonSecure)
                  <<  SPU_FEATURE_DPPIC_CHG_SECATTR_Pos));
            break;

        case NRF_SPU_FEATURE_GPIOTE_CHANNEL:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_GPIOTE_COUNT);
            NRFX_ASSERT(subindex < NRF_SPU_FEATURE_GPIOTE_CHANNEL_COUNT);
            p_reg->FEATURE.GPIOTE[index].CH[subindex] =
                ((p_reg->FEATURE.GPIOTE[index].CH[subindex] &
                  ~SPU_FEATURE_GPIOTE_CH_SECATTR_Msk) |
                 ((enable ?
                   SPU_FEATURE_GPIOTE_CH_SECATTR_Secure :
                   SPU_FEATURE_GPIOTE_CH_SECATTR_NonSecure)
                  <<  SPU_FEATURE_GPIOTE_CH_SECATTR_Pos));
            break;

