pillo79/ArduinoCore-zephyr/variants/arduino_nano_33_ble_nrf52840_sense/llext-edk/include/modules/hal/nordic/nrfx/hal/nrf_spu.h
        case NRF_SPU_FEATURE_GPIOTE_INTERRUPT:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_GPIOTE_COUNT);
            NRFX_ASSERT(subindex < NRF_SPU_FEATURE_GPIOTE_INTERRUPT_COUNT);
            p_reg->FEATURE.GPIOTE[index].INTERRUPT[subindex] =
                ((p_reg->FEATURE.GPIOTE[index].INTERRUPT[subindex] &
                  ~SPU_FEATURE_GPIOTE_INTERRUPT_SECATTR_Msk) |
                 ((enable ?
                   SPU_FEATURE_GPIOTE_INTERRUPT_SECATTR_Secure :
                   SPU_FEATURE_GPIOTE_INTERRUPT_SECATTR_NonSecure)
                  <<  SPU_FEATURE_GPIOTE_INTERRUPT_SECATTR_Pos));
            break;

        case NRF_SPU_FEATURE_GPIO_PIN:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_GPIO_COUNT);
            NRFX_ASSERT(subindex < NRF_SPU_FEATURE_GPIO_PIN_COUNT);
            p_reg->FEATURE.GPIO[index].PIN[subindex] =
                ((p_reg->FEATURE.GPIO[index].PIN[subindex] &
                  ~SPU_FEATURE_GPIO_PIN_SECATTR_Msk) |
                 ((enable ?
                   SPU_FEATURE_GPIO_PIN_SECATTR_Secure :
                   SPU_FEATURE_GPIO_PIN_SECATTR_NonSecure)
                  <<  SPU_FEATURE_GPIO_PIN_SECATTR_Pos));
            break;

        case NRF_SPU_FEATURE_GRTC_CC:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_GRTC_CC_COUNT);
            p_reg->FEATURE.GRTC.CC[index] =
                ((p_reg->FEATURE.GRTC.CC[index] &
                  ~SPU_FEATURE_GRTC_CC_SECATTR_Msk) |
                 ((enable ?
                   SPU_FEATURE_GRTC_CC_SECATTR_Secure :
                   SPU_FEATURE_GRTC_CC_SECATTR_NonSecure)
                  <<  SPU_FEATURE_GRTC_CC_SECATTR_Pos));
            break;

        case NRF_SPU_FEATURE_GRTC_SYSCOUNTER:
            p_reg->FEATURE.GRTC.SYSCOUNTER =
                ((p_reg->FEATURE.GRTC.SYSCOUNTER &
                  ~SPU_FEATURE_GRTC_SYSCOUNTER_SECATTR_Msk) |
                 ((enable ?
                   SPU_FEATURE_GRTC_SYSCOUNTER_SECATTR_Secure :
                   SPU_FEATURE_GRTC_SYSCOUNTER_SECATTR_NonSecure)
                  <<  SPU_FEATURE_GRTC_SYSCOUNTER_SECATTR_Pos));
            break;

        case NRF_SPU_FEATURE_GRTC_INTERRUPT:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_GRTC_INTERRUPT_COUNT);
            p_reg->FEATURE.GRTC.INTERRUPT[index] =
                ((p_reg->FEATURE.GRTC.INTERRUPT[index] &
                  ~SPU_FEATURE_GRTC_INTERRUPT_SECATTR_Msk) |
                 ((enable ?
                   SPU_FEATURE_GRTC_INTERRUPT_SECATTR_Secure :
                   SPU_FEATURE_GRTC_INTERRUPT_SECATTR_NonSecure)
                  <<  SPU_FEATURE_GRTC_INTERRUPT_SECATTR_Pos));
            break;

#if NRF_SPU_HAS_BELLS
#if NRF_SPU_HAS_DOMAIN
        case NRF_SPU_FEATURE_BELLS_BELL:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_BELL_BELL_COUNT);
            p_reg->FEATURE.BELLS.DOMAIN[index].BELL[subindex] =
                ((p_reg->FEATURE.BELLS.DOMAIN[index].BELL[subindex] &
                  ~SPU_FEATURE_BELLS_DOMAIN_BELL_SECATTR_Msk) |
                 ((enable ?
                   SPU_FEATURE_BELLS_DOMAIN_BELL_SECATTR_Secure :
                   SPU_FEATURE_BELLS_DOMAIN_BELL_SECATTR_NonSecure)
                  <<  SPU_FEATURE_BELLS_DOMAIN_BELL_SECATTR_Pos));
            break;
#else
        case NRF_SPU_FEATURE_BELLS_TASKS:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_BELLS_TASKS_COUNT);
            p_reg->FEATURE.BELLS.PROCESSOR[index].TASKS[subindex] =
                ((p_reg->FEATURE.BELLS.PROCESSOR[index].TASKS[subindex] &
                  ~SPU_FEATURE_BELLS_PROCESSOR_TASKS_SECATTR_Msk) |
                 ((enable ?
                   SPU_FEATURE_BELLS_PROCESSOR_TASKS_SECATTR_Secure :
                   SPU_FEATURE_BELLS_PROCESSOR_TASKS_SECATTR_NonSecure)
                  <<  SPU_FEATURE_BELLS_PROCESSOR_TASKS_SECATTR_Pos));
            break;

        case NRF_SPU_FEATURE_BELLS_EVENTS:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_BELLS_EVENTS_COUNT);
            p_reg->FEATURE.BELLS.PROCESSOR[index].EVENTS[subindex] =
                ((p_reg->FEATURE.BELLS.PROCESSOR[index].EVENTS[subindex] &
                  ~SPU_FEATURE_BELLS_PROCESSOR_EVENTS_SECATTR_Msk) |
                 ((enable ?
                   SPU_FEATURE_BELLS_PROCESSOR_EVENTS_SECATTR_Secure :
                   SPU_FEATURE_BELLS_PROCESSOR_EVENTS_SECATTR_NonSecure)
                  <<  SPU_FEATURE_BELLS_PROCESSOR_EVENTS_SECATTR_Pos));
            break;

        case NRF_SPU_FEATURE_BELLS_INTERRUPT:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_BELLS_INTERRUPT_COUNT);
            p_reg->FEATURE.BELLS.PROCESSOR[index].INTERRUPT[subindex] =
                ((p_reg->FEATURE.BELLS.PROCESSOR[index].INTERRUPT[subindex] &
                  ~SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_SECATTR_Msk) |
                 ((enable ?
                   SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_SECATTR_Secure :
                   SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_SECATTR_NonSecure)
                  <<  SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_SECATTR_Pos));
            break;
#endif // NRF_SPU_HAS_DOMAIN
#endif // NRF_SPU_HAS_BELLS

#if NRF_SPU_HAS_TDD
        case NRF_SPU_FEATURE_TDD:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_TDD_COUNT);
            p_reg->FEATURE.TDD[index] =
                ((p_reg->FEATURE.TDD[index] &
                  ~SPU_FEATURE_TDD_SECATTR_Msk) |
                 ((enable ?
                   SPU_FEATURE_TDD_SECATTR_Secure :
                   SPU_FEATURE_TDD_SECATTR_NonSecure)
                  << SPU_FEATURE_TDD_SECATTR_Pos));
            break;
#endif // NRF_SPU_HAS_TDD

#if NRF_SPU_HAS_MRAMC
        case NRF_SPU_FEATURE_MRAMC_WAITSTATES:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_MRAMC_COUNT);
            p_reg->FEATURE.MRAMC[index].WAITSTATES =
                ((p_reg->FEATURE.MRAMC[index].WAITSTATES &
                  ~SPU_FEATURE_MRAMC_WAITSTATES_SECATTR_Msk) |
                 ((enable ?
                   SPU_FEATURE_MRAMC_WAITSTATES_SECATTR_Secure :
                   SPU_FEATURE_MRAMC_WAITSTATES_SECATTR_NonSecure)
                  << SPU_FEATURE_MRAMC_WAITSTATES_SECATTR_Pos));
            break;

        case NRF_SPU_FEATURE_MRAMC_AUTODPOWERDOWN:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_MRAMC_COUNT);
            p_reg->FEATURE.MRAMC[index].AUTODPOWERDOWN =
                ((p_reg->FEATURE.MRAMC[index].AUTODPOWERDOWN &
                  ~SPU_FEATURE_MRAMC_AUTODPOWERDOWN_SECATTR_Msk) |
                 ((enable ?
                   SPU_FEATURE_MRAMC_AUTODPOWERDOWN_SECATTR_Secure :
                   SPU_FEATURE_MRAMC_AUTODPOWERDOWN_SECATTR_NonSecure)
                  << SPU_FEATURE_MRAMC_AUTODPOWERDOWN_SECATTR_Pos));
            break;

        case NRF_SPU_FEATURE_MRAMC_READY:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_MRAMC_COUNT);
            p_reg->FEATURE.MRAMC[index].READY =
                ((p_reg->FEATURE.MRAMC[index].READY &
                  ~SPU_FEATURE_MRAMC_READY_SECATTR_Msk) |
                 ((enable ?
                   SPU_FEATURE_MRAMC_READY_SECATTR_Secure :
                   SPU_FEATURE_MRAMC_READY_SECATTR_NonSecure)
                  << SPU_FEATURE_MRAMC_READY_SECATTR_Pos));
            break;
#endif // NRF_SPU_HAS_MRAMC

        default:
            NRFX_ASSERT(0);
            break;
    }
}

NRF_STATIC_INLINE void nrf_spu_feature_lock_enable(NRF_SPU_Type *    p_reg,
                                                   nrf_spu_feature_t feature,
                                                   uint8_t           index,
                                                   uint8_t           subindex)
{
    switch (feature)
    {
#if NRF_SPU_HAS_IPCT
        case NRF_SPU_FEATURE_IPCT_CHANNEL:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_IPCT_CHANNEL_COUNT);
            p_reg->FEATURE.IPCT.CH[index] =
                ((p_reg->FEATURE.IPCT.CH[index] &
                  ~SPU_FEATURE_IPCT_CH_LOCK_Msk) |
                 (SPU_FEATURE_IPCT_CH_LOCK_Locked
                  << SPU_FEATURE_IPCT_CH_LOCK_Pos));
            break;

        case NRF_SPU_FEATURE_IPCT_INTERRUPT:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_IPCT_INTERRUPT_COUNT);
            p_reg->FEATURE.IPCT.INTERRUPT[index] =
                ((p_reg->FEATURE.IPCT.INTERRUPT[index] &
                  ~SPU_FEATURE_IPCT_INTERRUPT_LOCK_Msk) |
                 (SPU_FEATURE_IPCT_INTERRUPT_LOCK_Locked
                  << SPU_FEATURE_IPCT_INTERRUPT_LOCK_Pos));
            break;
#endif // NRF_SPU_HAS_IPCT

