pillo79/ArduinoCore-zephyr/variants/arduino_nano_33_ble_nrf52840_sense/llext-edk/include/modules/hal/nordic/nrfx/hal/nrf_spu.h
#if NRF_SPU_HAS_BLOCK
NRF_STATIC_INLINE void nrf_spu_feature_block_enable(NRF_SPU_Type *    p_reg,
                                                    nrf_spu_feature_t feature,
                                                    uint8_t           index,
                                                    uint8_t           subindex)
{
    switch (feature)
    {
#if NRF_SPU_HAS_IPCT
        case NRF_SPU_FEATURE_IPCT_CHANNEL:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_IPCT_CHANNEL_COUNT);
            p_reg->FEATURE.IPCT.CH[index] =
                ((p_reg->FEATURE.IPCT.CH[index] &
                  ~SPU_FEATURE_IPCT_CH_BLOCK_Msk) |
                 (SPU_FEATURE_IPCT_CH_BLOCK_Blocked
                  << SPU_FEATURE_IPCT_CH_BLOCK_Pos));
            break;

        case NRF_SPU_FEATURE_IPCT_INTERRUPT:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_IPCT_INTERRUPT_COUNT);
            p_reg->FEATURE.IPCT.INTERRUPT[index] =
                ((p_reg->FEATURE.IPCT.INTERRUPT[index] &
                  ~SPU_FEATURE_IPCT_INTERRUPT_BLOCK_Msk) |
                 (SPU_FEATURE_IPCT_INTERRUPT_BLOCK_Blocked
                  << SPU_FEATURE_IPCT_INTERRUPT_BLOCK_Pos));
            break;
#endif // NRF_SPU_HAS_IPCT

        case NRF_SPU_FEATURE_DPPI_CHANNEL:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_DPPI_CHANNEL_COUNT);
            p_reg->FEATURE.DPPIC.CH[index] =
                ((p_reg->FEATURE.DPPIC.CH[index] &
                  ~SPU_FEATURE_DPPIC_CH_BLOCK_Msk) |
                 (SPU_FEATURE_DPPIC_CH_BLOCK_Blocked
                  << SPU_FEATURE_DPPIC_CH_BLOCK_Pos));
            break;

        case NRF_SPU_FEATURE_DPPI_CHANNEL_GROUP:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_DPPI_CHANNEL_GROUP_COUNT);
            p_reg->FEATURE.DPPIC.CHG[index] =
                ((p_reg->FEATURE.DPPIC.CHG[index] &
                  ~SPU_FEATURE_DPPIC_CHG_BLOCK_Msk) |
                 (SPU_FEATURE_DPPIC_CHG_BLOCK_Blocked
                  << SPU_FEATURE_DPPIC_CHG_BLOCK_Pos));
            break;

        case NRF_SPU_FEATURE_GPIOTE_CHANNEL:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_GPIOTE_COUNT);
            NRFX_ASSERT(subindex < NRF_SPU_FEATURE_GPIOTE_CHANNEL_COUNT);
            p_reg->FEATURE.GPIOTE[index].CH[subindex] =
                ((p_reg->FEATURE.GPIOTE[index].CH[subindex] &
                  ~SPU_FEATURE_GPIOTE_CH_BLOCK_Msk) |
                 (SPU_FEATURE_GPIOTE_CH_BLOCK_Blocked
                  << SPU_FEATURE_GPIOTE_CH_BLOCK_Pos));
            break;

        case NRF_SPU_FEATURE_GPIOTE_INTERRUPT:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_GPIOTE_COUNT);
            NRFX_ASSERT(subindex < NRF_SPU_FEATURE_GPIOTE_INTERRUPT_COUNT);
            p_reg->FEATURE.GPIOTE[index].INTERRUPT[subindex] =
                ((p_reg->FEATURE.GPIOTE[index].INTERRUPT[subindex] &
                  ~SPU_FEATURE_GPIOTE_INTERRUPT_BLOCK_Msk) |
                 (SPU_FEATURE_GPIOTE_INTERRUPT_BLOCK_Blocked
                  << SPU_FEATURE_GPIOTE_INTERRUPT_BLOCK_Pos));
            break;

        case NRF_SPU_FEATURE_GPIO_PIN:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_GPIO_COUNT);
            NRFX_ASSERT(subindex < NRF_SPU_FEATURE_GPIO_PIN_COUNT);
            p_reg->FEATURE.GPIO[index].PIN[subindex] =
                ((p_reg->FEATURE.GPIO[index].PIN[subindex] &
                  ~SPU_FEATURE_GPIO_PIN_BLOCK_Msk) |
                 (SPU_FEATURE_GPIO_PIN_BLOCK_Blocked
                  << SPU_FEATURE_GPIO_PIN_BLOCK_Pos));
            break;

        case NRF_SPU_FEATURE_GRTC_CC:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_GRTC_CC_COUNT);
            p_reg->FEATURE.GRTC.CC[index] =
                ((p_reg->FEATURE.GRTC.CC[index] &
                  ~SPU_FEATURE_GRTC_CC_BLOCK_Msk) |
                 (SPU_FEATURE_GRTC_CC_BLOCK_Blocked
                  << SPU_FEATURE_GRTC_CC_BLOCK_Pos));
            break;

        case NRF_SPU_FEATURE_GRTC_SYSCOUNTER:
            p_reg->FEATURE.GRTC.SYSCOUNTER =
                ((p_reg->FEATURE.GRTC.SYSCOUNTER &
                  ~SPU_FEATURE_GRTC_SYSCOUNTER_BLOCK_Msk) |
                 (SPU_FEATURE_GRTC_SYSCOUNTER_BLOCK_Blocked
                  << SPU_FEATURE_GRTC_SYSCOUNTER_BLOCK_Pos));
            break;

        case NRF_SPU_FEATURE_GRTC_INTERRUPT:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_GRTC_INTERRUPT_COUNT);
            p_reg->FEATURE.GRTC.INTERRUPT[index] =
                ((p_reg->FEATURE.GRTC.INTERRUPT[index] &
                  ~SPU_FEATURE_GRTC_INTERRUPT_BLOCK_Msk) |
                 (SPU_FEATURE_GRTC_INTERRUPT_BLOCK_Blocked
                  << SPU_FEATURE_GRTC_INTERRUPT_BLOCK_Pos));
            break;

#if NRF_SPU_HAS_BELLS
#if NRF_SPU_HAS_DOMAIN
        case NRF_SPU_FEATURE_BELLS_BELL:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_BELL_BELL_COUNT);
            p_reg->FEATURE.BELLS.DOMAIN[index].BELL[subindex] =
                ((p_reg->FEATURE.BELLS.DOMAIN[index].BELL[subindex] &
                  ~SPU_FEATURE_BELLS_DOMAIN_BELL_BLOCK_Msk) |
                 (SPU_FEATURE_BELLS_DOMAIN_BELL_BLOCK_Blocked
                  << SPU_FEATURE_BELLS_DOMAIN_BELL_BLOCK_Pos));
            break;
#else
        case NRF_SPU_FEATURE_BELLS_TASKS:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_BELLS_TASKS_COUNT);
            p_reg->FEATURE.BELLS.PROCESSOR[index].TASKS[subindex] =
                ((p_reg->FEATURE.BELLS.PROCESSOR[index].TASKS[subindex] &
                  ~SPU_FEATURE_BELLS_PROCESSOR_TASKS_BLOCK_Msk) |
                 (SPU_FEATURE_BELLS_PROCESSOR_TASKS_BLOCK_Blocked
                  << SPU_FEATURE_BELLS_PROCESSOR_TASKS_BLOCK_Pos));
            break;

        case NRF_SPU_FEATURE_BELLS_EVENTS:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_BELLS_EVENTS_COUNT);
            p_reg->FEATURE.BELLS.PROCESSOR[index].EVENTS[subindex] =
                ((p_reg->FEATURE.BELLS.PROCESSOR[index].EVENTS[subindex] &
                  ~SPU_FEATURE_BELLS_PROCESSOR_EVENTS_BLOCK_Msk) |
                 (SPU_FEATURE_BELLS_PROCESSOR_EVENTS_BLOCK_Blocked
                  << SPU_FEATURE_BELLS_PROCESSOR_EVENTS_BLOCK_Pos));
            break;

        case NRF_SPU_FEATURE_BELLS_INTERRUPT:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_BELLS_INTERRUPT_COUNT);
            p_reg->FEATURE.BELLS.PROCESSOR[index].INTERRUPT[subindex] =
                ((p_reg->FEATURE.BELLS.PROCESSOR[index].INTERRUPT[subindex] &
                  ~SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_BLOCK_Msk) |
                 (SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_BLOCK_Blocked
                  << SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_BLOCK_Pos));
            break;
#endif // NRF_SPU_HAS_DOMAIN
#endif // NRF_SPU_HAS_BELLS

#if NRF_SPU_HAS_TDD
        case NRF_SPU_FEATURE_TDD:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_TDD_COUNT);
            p_reg->FEATURE.TDD[index] =
                ((p_reg->FEATURE.TDD[index] &
                  ~SPU_FEATURE_TDD_BLOCK_Msk) |
                 (SPU_FEATURE_TDD_BLOCK_Blocked
                  << SPU_FEATURE_TDD_BLOCK_Pos));
            break;
#endif // NRF_SPU_HAS_TDD

#if NRF_SPU_HAS_MRAMC
        case NRF_SPU_FEATURE_MRAMC_WAITSTATES:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_MRAMC_COUNT);
            p_reg->FEATURE.MRAMC[index].WAITSTATES =
                ((p_reg->FEATURE.MRAMC[index].WAITSTATES &
                  ~SPU_FEATURE_MRAMC_WAITSTATES_BLOCK_Msk) |
                 (SPU_FEATURE_MRAMC_WAITSTATES_BLOCK_Blocked
                  << SPU_FEATURE_MRAMC_WAITSTATES_BLOCK_Pos));
            break;

        case NRF_SPU_FEATURE_MRAMC_AUTODPOWERDOWN:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_MRAMC_COUNT);
            p_reg->FEATURE.MRAMC[index].AUTODPOWERDOWN =
                ((p_reg->FEATURE.MRAMC[index].AUTODPOWERDOWN &
                  ~SPU_FEATURE_MRAMC_AUTODPOWERDOWN_BLOCK_Msk) |
                 (SPU_FEATURE_MRAMC_AUTODPOWERDOWN_BLOCK_Blocked
                  << SPU_FEATURE_MRAMC_AUTODPOWERDOWN_BLOCK_Pos));
            break;

        case NRF_SPU_FEATURE_MRAMC_READY:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_MRAMC_COUNT);
            p_reg->FEATURE.MRAMC[index].READY =
                ((p_reg->FEATURE.MRAMC[index].READY &
                  ~SPU_FEATURE_MRAMC_READY_BLOCK_Msk) |
                 (SPU_FEATURE_MRAMC_READY_BLOCK_Blocked
                  << SPU_FEATURE_MRAMC_READY_LOCK_Pos));
            break;
#endif // NRF_SPU_HAS_MRAMC

        default:
            NRFX_ASSERT(0);
            break;
    }
}
#endif // NRF_SPU_HAS_BLOCK

#if NRF_SPU_HAS_OWNERSHIP
NRF_STATIC_INLINE void nrf_spu_feature_ownerid_set(NRF_SPU_Type *    p_reg,
                                                   nrf_spu_feature_t feature,
                                                   uint8_t           index,
                                                   uint8_t           subindex,
                                                   nrf_owner_t       owner_id)
{
    switch (feature)
    {
#if NRF_SPU_HAS_IPCT
        case NRF_SPU_FEATURE_IPCT_CHANNEL:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_IPCT_CHANNEL_COUNT);
            p_reg->FEATURE.IPCT.CH[index] =
                ((p_reg->FEATURE.IPCT.CH[index] &
                  ~SPU_FEATURE_IPCT_CH_OWNERID_Msk) |
                 ((owner_id
                   << SPU_FEATURE_IPCT_CH_OWNERID_Pos) &
                  SPU_FEATURE_IPCT_CH_OWNERID_Msk));
            break;

        case NRF_SPU_FEATURE_IPCT_INTERRUPT:
            NRFX_ASSERT(index < NRF_SPU_FEATURE_IPCT_INTERRUPT_COUNT);
            p_reg->FEATURE.IPCT.INTERRUPT[index] =
                ((p_reg->FEATURE.IPCT.INTERRUPT[index] &
                  ~SPU_FEATURE_IPCT_INTERRUPT_OWNERID_Msk) |
                 ((owner_id
                   << SPU_FEATURE_IPCT_INTERRUPT_OWNERID_Pos) &
                  SPU_FEATURE_IPCT_INTERRUPT_OWNERID_Msk));
            break;
#endif // NRF_SPU_HAS_IPCT

